# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# 番茄叶片分类模型配置
# 基于YOLO11架构，添加了注意力机制和高级卷积模块

# 参数设置
nc: 10  # 番茄分类的类别数量
scales:  # 模型复合缩放常数
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # 轻量级模型
  s: [0.50, 0.50, 1024]  # 小型模型
  m: [0.67, 0.75, 768]   # 中型模型
  l: [1.00, 1.00, 512]   # 大型模型

# 主干网络
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2: 标准卷积层
  - [-1, 1, DepthwiseSeparableConv, [128, 3, 2]]  # 1-P2/4: 深度可分离卷积，减少参数量
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2: 轻量级C3模块
  - [-1, 1, SELayer, [256]]  # 3: 添加SE注意力机制，增强特征表达
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8: 下采样
  - [-1, 2, C3k2, [384, False, 0.25]]  # 5: 增加通道数
  - [-1, 1, CBAM, [384]]  # 6: 卷积注意力模块，同时关注通道和空间维度
  # - [-1, 1, DilatedConv, [384, 3, 2, 2]]  # 7-P4/16: 空洞卷积，增大感受野
  - [-1, 2, C3k2, [512, True]]  # 8: 标准C3模块
  - [-1, 1, ECA_Layer, [512]]  # 9: 高效通道注意力
  - [-1, 1, Conv, [768, 3, 2]]  # 10-P5/32: 最终下采样
  - [-1, 2, C3k2, [768, True]]  # 11: 深层特征提取
  - [-1, 1, SPPF, [768, 5]]  # 12: 空间金字塔池化，捕获多尺度信息

# 分类头部
head:
  - [-1, 1, nn.AdaptiveAvgPool2d, [1]]  # 13: 自适应平均池化到1x1
  - [-1, 1, nn.Flatten, []]  # 14: 展平特征
  - [-1, 1, nn.Dropout, [0.2]]  # 15: 添加Dropout防止过拟合
  - [-1, 1, nn.Linear, [nc]]  # 16: 分类层