# yolo_cnn.yaml (修正版本)
task: classify  # 明确指定任务类型
nc: 10  # 类别数量，例如 MNIST 是 10 类

# 模型架构
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3, 1]]  # 0: 卷积层
  - [-1, 1, nn.ReLU, [True]]   # 1: ReLU 激活函数
  - [-1, 1, nn.MaxPool2d, [2]] # 2: 最大池化层
  - [-1, 1, nn.Flatten, []]     # 3: 展平层

# 全连接层
head:
  - [-1, 1, nn.Linear, [401408, 128]]  # 4: 第一个全连接层，输入 256，输出 128
  - [-1, 1, nn.ReLU, [True]]        # 5: ReLU 激活函数
  - [-1, 1, nn.Linear, [128, nc]]   # 6: 第二个全连接层，输入 128，输出类别数（10）

  # 输出层，通常在分类任务中最后使用 Softmax 或 LogSoftmax 激活函数
  - [-1, 1, nn.LogSoftmax, [1]]    # 7: LogSoftmax 激活函数