# 参数设置
nc: 10  # 番茄分类的类别数量
scales:  # 模型复合缩放常数
  n: [0.50, 0.25, 1024]  # 轻量级模型
  s: [0.50, 0.50, 1024]  # 小型模型
  m: [0.67, 0.75, 768]   # 中型模型
  l: [1.00, 1.00, 512]   # 大型模型

# 主干网络
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 1]]  # 0: 单一卷积层，输出32个特征图，3x3卷积，步幅1
  - [-1, 1, nn.ReLU, []]       # 1: ReLU激活函数
  - [-1, 1, nn.MaxPool2d, [2]] # 2: 最大池化层，2x2池化
  # - [-1, 1, nn.Flatten, []]    # 3: 展平层
  - [-1, 1, nn.Linear, [256, nc]]  # 4: 全连接层，输入256，输出nc个类别

# 分类头部
head:
  - [-1, 1, nn.LogSoftmax, [1]]  # 5: LogSoftmax激活函数